[
  {
    "source": "CryptoSlate",
    "original_id": "https://cryptoslate.com/?p=507252",
    "title": "It’s foolish to pretend Bitcoin’s story doesn’t include $79k this year",
    "link": "https://cryptoslate.com/the-hubris-in-pretending-bitcoins-story-doesnt-include-79k-this-year/",
    "description": "<p>Bitcoin is slipping again, and the mood across the market is shifting. Traders who were celebrating six-figure prices only weeks ago are suddenly watching key levels evaporate. The move below $106,400 was the first real warning sign, the collapse through $99,000 confirmed that the market is no longer treating those supports as serious areas of [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/the-hubris-in-pretending-bitcoins-story-doesnt-include-79k-this-year/\">It&#8217;s foolish to pretend Bitcoin’s story doesn’t include $79k this year</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>",
    "content": "<p><a href=\"https://cryptoslate.com/coins/bitcoin\">Bitcoin</a> is slipping again, and the mood across the market is shifting. Traders who were celebrating six-figure prices only weeks ago are suddenly watching key levels evaporate.</p>\n<p>The move below $106,400 was the first real warning sign, the collapse through $99,000 confirmed that the market is no longer treating those supports as serious areas of interest.</p>\n<p>Now the charts are pointing toward the lower boundaries of the same ETF-era channels that have guided Bitcoin’s entire structure since January 2024.</p>\n<p>I have been tracking these horizontal channels since the day the ETFs launched. They have acted as remarkably accurate markers of support and resistance, a kind of real-time heat map of where liquidity is concentrated.</p>\n<figure class=\"wp-caption aligncenter\" id=\"attachment_507278\" style=\"width: 1024px;\"><img alt=\"Bitcoin price channels (Source: TradingView)\" class=\"wp-image-507278 size-large\" height=\"831\" src=\"https://cryptoslate.com/wp-content/uploads/2025/11/Screenshot-2025-11-14-at-14.46.42-1024x831.png\" width=\"1024\" /><figcaption class=\"wp-caption-text\" id=\"caption-attachment-507278\">Bitcoin price channels (Source: TradingView)</figcaption></figure>\n<p>Each colored band represents a price range where Bitcoin spent time consolidating, indicating that leverage built up there and market participants anchored their decisions to those levels. Breaking through a channel requires meaningful pressure, whether it is buyers overwhelming sellers or the opposite.</p>\n<p>That pressure is clearly coming from the sell side now.</p>\n<h2>A Strange Cycle From the Beginning</h2>\n<p>This cycle never fit the usual template. Historically, Bitcoin has never reached a new all-time high so close to an upcoming halving.</p>\n<p>Yet in early 2024, Bitcoin broke the old $69,000 high months before the halving even arrived. It was the earliest breakout in Bitcoin’s history, setting the tone for the year.</p>\n<figure class=\"wp-caption aligncenter\" id=\"attachment_507277\" style=\"width: 1024px;\"><img alt=\"Bitcoin halving channels (Source: TradingView)\" class=\"wp-image-507277 size-large\" height=\"835\" src=\"https://cryptoslate.com/wp-content/uploads/2025/11/Screenshot-2025-11-14-at-14.55.42-1024x835.png\" width=\"1024\" /><figcaption class=\"wp-caption-text\" id=\"caption-attachment-507277\">Bitcoin halving channels (Source: TradingView)</figcaption></figure>\n<p>By the time we reached October this year, the price had surged to $126,000. Based on previous cycle timing and the behavior around halving dates, I called that the top.</p>\n<p>If that <a href=\"https://cryptoslate.com/hodl-or-take-profits-the-bitcoin-bear-market-cycle-started-at-126k/\">call was correct</a>, we are now in the first chapters of the bear market.</p>\n<p>Cycle timing usually explains these transitions, although the ETF era complicates things. Issuance is still declining, but the dominant force now appears to be liquidity.</p>\n<p>When billions of dollars can enter or leave the market in a single day through regulated vehicles, the market reacts very differently to the old retail-driven structure.</p>\n<p>Even with those changes, the channels drawn from ETF-era price behavior have held up with surprising consistency.</p>\n<h2>The Breakdown, Level by Level</h2>\n<p>Bitcoin has now fallen through two of the most important bands. The <a href=\"https://cryptoslate.com/bull-or-bear-todays-106k-retest-could-decide-bitcoins-fate/\">$106,400 support</a> level had acted as an upper spine for months, and the $99,000 level was built through heavy trading activity during June.</p>\n<p>Losing both of those zones in one extended move shows how quickly institutional liquidity can be pulled. Buyers who defended these areas earlier in the year are no longer stepping in.</p>\n<p>Right now, the price is drifting toward the bottom of the orange channel, which sits around $93,000. This region had solid engagement earlier in the trend, so it has a chance of slowing the decline, although it is not a guaranteed bounce zone.</p>\n<figure class=\"wp-caption aligncenter\" id=\"attachment_507280\" style=\"width: 1024px;\"><img alt=\"Bitcoin price decline (Source: TradingView)\" class=\"wp-image-507280 size-large\" height=\"785\" src=\"https://cryptoslate.com/wp-content/uploads/2025/11/Screenshot-2025-11-14-at-14.43.22-1024x785.png\" width=\"1024\" /><figcaption class=\"wp-caption-text\" id=\"caption-attachment-507280\">Bitcoin price decline (Source: TradingView)</figcaption></figure>\n<p>If that fails, the next major region is the purple channel. Its lower bound sits around $85,000.</p>\n<p>What concerns me here is the lack of previous price action. Bitcoin moved through this band quickly the last time it passed through, which means the market never had time to build strong positioning there.</p>\n<p>Channels with little historical consolidation often offer weak support because there is not much leverage anchored to those levels. Either the top of the purple channel becomes a point where buyers draw a line, or price slips directly through it, which would open the path toward the green channel.</p>\n<p>The green band sits around $79,000 at its bottom, and this is a more substantial region. Bitcoin spent time consolidating in this zone during earlier legs of the cycle, so if we reach it, reactions should be stronger.</p>\n<p>It would not be surprising to see buyers re-emerge here, especially if sentiment stabilizes around the idea that sub-$80,000 prices are an opportunity.</p>\n<p>Below that, we get into the deep structural supports, the red and blue channels that formed through months of trading in 2024. These represent $49,000 to $56,000, an area that Bitcoin defended repeatedly before the run toward six figures began.</p>\n<p>Hitting those levels this year would be an extremely heavy correction and more in line with a classic cycle bottom, which usually falls deeper into the multi-year pattern, typically around 2026 or 2027.</p>\n<h2>The Liquidity Problem</h2>\n<p>There is no escaping the importance of liquidity here. The <a href=\"https://cryptoslate.com/bitcoin-tests-the-95k-hodl-wall-after-cascade-knocks-out-655m-from-bulls/\">second-largest ETF outflow</a> on record hit the market yesterday.</p>\n<p>Risk appetite is fading, and the institutions that helped push Bitcoin to new highs appear to be reducing exposure. In that kind of environment, reclaiming and holding $100,000 becomes difficult.</p>\n<p>If the outflows continue, there is a realistic chance that Bitcoin keeps moving through the lower channels I have outlined. This does not require a collapse in fundamentals.</p>\n<p>It only requires persistent risk-off sentiment and a steady shift toward cash and short-duration assets. When liquidity dries up, Bitcoin trades like a levered proxy for macro conditions.</p>\n<h2>So How Low Can It Go?</h2>\n<p>Based on the channel structure and the current flow environment:</p>\n<ul>\n<li><strong>$93,000</strong> is the next logical test.</li>\n<li><strong>$85,000</strong> comes into play if orange support fails.</li>\n<li><strong>$79,000</strong> is the most realistic deeper target and a level that could hold even in a strong correction.</li>\n<li><strong>$49,000 to $56,000</strong> sits far below as the ultimate cycle support, more likely a 2026–27 story unless liquidity deteriorates dramatically.</li>\n</ul>\n<p>It is tempting to think that six figures is now the baseline for Bitcoin and that any drop into the eighties or seventies would be irrational. The structure says otherwise.</p>\n<p>The ETF era created clear regions of support and resistance, and Bitcoin is now falling through them in the same way it rose through them on the way up. Until liquidity turns, the lower channels remain in play.</p>\n<p>The post <a href=\"https://cryptoslate.com/the-hubris-in-pretending-bitcoins-story-doesnt-include-79k-this-year/\">It&#8217;s foolish to pretend Bitcoin’s story doesn’t include $79k this year</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>",
    "author": "Liam 'Akiba' Wright",
    "published_at": "2025-11-15T03:00:11",
    "categories": [
      "Analysis",
      "Bear Market",
      "Featured",
      "Macro"
    ]
  },
  {
    "source": "CryptoSlate",
    "original_id": "https://cryptoslate.com/?p=507031",
    "title": "US debt hits 368M BTC: American debt machine adds a century worth of new Bitcoin supply this year alone",
    "link": "https://cryptoslate.com/americas-debt-machine-just-hit-368m-btc-this-years-surge-equals-100-years-of-new-bitcoin-supply/",
    "description": "<p>The U.S. national debt surpassed $38 trillion in early November, and denoting the stock in bitcoin reveals a larger move than the underlying BTC price since January 20. According to the U.S. Treasury’s Debt to the Penny dataset, total public debt stood at $38.118 trillion as of November 6, up about $1.1 trillion since August [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/americas-debt-machine-just-hit-368m-btc-this-years-surge-equals-100-years-of-new-bitcoin-supply/\">US debt hits 368M BTC: American debt machine adds a century worth of new Bitcoin supply this year alone</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>",
    "content": "<p>The U.S. national debt surpassed $38 trillion in early November, and denoting the stock in bitcoin reveals a larger move than the underlying BTC price since January 20.</p>\n<p>According to the U.S. Treasury’s <a href=\"https://fiscaldata.treasury.gov/datasets/debt-to-the-penny/debt-to-the-penny\">Debt to the Penny</a> dataset, total public debt stood at $38.118 trillion as of November 6, up about $1.1 trillion since August 12 and above the late October breach of $38 trillion that drew new headlines.</p>\n<p>The $37 trillion threshold first made news in mid-August, then the next trillion arrived within weeks as issuance continued.</p>\n<p>Over the same period, spot BTC has generally traded within the $100,000 to $105,000 band this month, with a January 20 close of $102,082.</p>\n<p>Therefore, the unit-of-account lens revealed a larger move in debt than in price at the start of the week. The inauguration day reference price is $102,082, placing today’s level within 10% of that mark.</p>\n<p>Sani from TimechainIndex <a href=\"https://x.com/SaniExp/status/1988894479969845568?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1988894479969845568%7Ctwgr%5E11dd190dd52c00ffdb8c9d5dcf4dd9cc76d3f6d4%7Ctwcon%5Es1_c10&amp;ref_url=https%3A%2F%2Fcryptoslate.com%2Fwp-admin%2Fpost.php%3Fpost%3D507031action%3Dedit\">calculated</a> that, at a working price of $103,500 per BTC, the current U.S. public debt equates to roughly 368.3 million BTC, calculated as $38.118 trillion divided by the BTC price.</p>\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">On January 20th, when <a href=\"https://twitter.com/realDonaldTrump?ref_src=twsrc%5Etfw\">@realDonaldTrump</a> took office, Bitcoin was priced at $103,500, the same price it is trading at today.</p>\n<p>During that time, the U.S. National Debt rose by $1.9 trillion, reaching $38.126 trillion.</p>\n<p>In Bitcoin terms, the debt grew by 18.566 million BTC, totaling… <a href=\"https://t.co/du0NucMFa4\">pic.twitter.com/du0NucMFa4</a></p>\n<p>&mdash; Sani | TimechainIndex.com (@SaniExp) <a href=\"https://twitter.com/SaniExp/status/1988894479969845568?ref_src=twsrc%5Etfw\">November 13, 2025</a></p></blockquote>\n<p></p>\n<p>With the debt stock rising by approximately $1.9 trillion since January 20, valuing the change at $103,500 per BTC yields approximately 18.36 million BTC.</p>\n<p>As Bitcoin has fallen over 6% since Sani posted his insight, this would work out to 19.8 million BTC at $96,000.</p>\n<p>With post-halving issuance near 450 BTC per day, or about 164,250 BTC per year, that single ten-month increase maps to more than a century of new supply.</p>\n<p>Flows into and out of U.S. spot bitcoin ETFs add an incremental pressure valve.</p>\n<p>U.S. spot ETF flow tallies have been mixed through early November, which matters for the mechanical link between demand, price, and the “debt expressed in BTC” ratio.</p>\n<p>On the fiscal side, Treasury is still raising net new cash at quarterly refundings. In November, the Treasury announced $125 billion of issuance to refund $98.2 billion coming due, raising $26.8 billion of new cash. According to the U.S. Department of the Treasury’s <a href=\"https://home.treasury.gov/news/press-releases/sb0305\">quarterly refunding statement</a> and <a href=\"https://home.treasury.gov/news/press-releases/sb0307\">TBAC minutes</a>, ongoing SOMA runoff and a heavy maturity schedule maintain a steady financing need.</p>\n<p>The simple math highlights how a fixed-supply asset interacts with a rising liability. Even if BTC trades at $200,000, the debt stock would still equal about 191 million BTC using the current $38.118 trillion level.</p>\n<p>That is an order of magnitude above today’s circulating supply of roughly 19 to 20 million coins. On-chain supply inches higher predictably, while the debt numerator can add hundreds of billions within weeks, depending on issuance and cash balances.</p>\n<p>Sensitivity to BTC price is straightforward to frame, and the table below shows how the “debt in BTC” number compresses as price rises, holding the latest debt tally constant and rounding to one decimal place for readability.</p>\n<table>\n<thead>\n<tr>\n<th>BTCUSD</th>\n<th>U.S. Debt (in BTC)</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>$80,000</td>\n<td>~476.5 million BTC</td>\n</tr>\n<tr>\n<td>$100,000</td>\n<td>~381.2 million BTC</td>\n</tr>\n<tr>\n<td>$103,500</td>\n<td>~368.3 million BTC</td>\n</tr>\n<tr>\n<td>$120,000</td>\n<td>~317.7 million BTC</td>\n</tr>\n<tr>\n<td>$150,000</td>\n<td>~254.1 million BTC</td>\n</tr>\n<tr>\n<td>$200,000</td>\n<td>~190.6 million BTC</td>\n</tr>\n</tbody>\n</table>\n<p>A practical rule of thumb near current levels is that each $10,000 move in BTC changes the “debt in BTC” figure by roughly 32 to 36 million BTC, a 9–10% shift that is nonlinear across the curve.</p>\n<p>The framing is not a claim that the United States could or would repay obligations in bitcoin; rather, it is a unit-of-account lens that compares a fixed-issuance asset with a fiscal path driven by policy and macroeconomic conditions.</p>\n<p>The lens is also sensitive to date alignment. Treasury’s daily debt data posts with a lag, so matching the same calendar day for the debt close and the BTCUSD close matters for precision. Different price sources will vary by 1–2%, so stating the source in each calculation helps keep the arithmetic auditable.</p>\n<p>Forward, the path of the numerator and denominator will decide whether the chart bends lower. On the numerator, the Treasury’s term structure choices and net new cash needs will determine rollover intensity and the interest cost path into 2026.</p>\n<p>According to the refunding statement, approximately 31% of marketable debt has been maturing within 12 months in recent quarters, with an average maturity of nearly six years. This mix keeps bill share and coupon sizing in focus if yields hold near current ranges.</p>\n<p>On the denominator, ETF flow regimes can shift quickly, and sustained positive flows would support spot demand, which mechanically reduces the “debt in BTC” ratio. Week-to-week swings remain common as funds and advisers rebalance.</p>\n<p>The macro overlay from budget projections leans toward larger interest costs in the baseline. The <a href=\"https://www.cbo.gov/publication/61172\">Congressional Budget Office</a> 2025 to 2035 outlook shows net interest rising toward about 4% of GDP by 2035, with debt held by the public projected to reach around 156% of GDP by 2055 absent policy changes.</p>\n<p>According to the <a href=\"https://www.crfb.org/blogs/cbo-releases-january-2025-budget-and-economic-outlook\">Committee for a Responsible Federal Budget&#8217;s</a> summary of the CBO baseline, near-term real growth under 2% and inflation drifting toward 2% leave the nominal GDP denominator without a strong boost, which reinforces the arithmetic of a steady or higher “debt in BTC” reading unless price lifts or deficits compress.</p>\n<p>Replicating the math is straightforward. Pull the latest Total Public Debt Outstanding from the Treasury’s Debt to the Penny portal, pull a same-day BTCUSD close from a consistent index, then compute &#8216;Debt in BTC&#8217; as DebtUSD divided by BTCUSD.</p>\n<p>For issuance context, use 450 BTC per day post-halving. This method yields the 368.3 million BTC figure at a $103,500 price on a $38.118 trillion debt base, and the roughly 18.36 million BTC equivalent of the year-to-date increase when mapped at the same price.</p>\n<p>What to watch over the next quarter is the mix at Treasury’s auctions, any change in net new cash targets, the evolution of ETF flows, and the subsequent CBO updates as FY26 tax debates resume.</p>\n<p>A move in any of those inputs will show up in either the numerator or the denominator.</p>\n<p>According to the Treasury’s November statement, the current refunding raised $26.8 billion in new cash while refunding $98.2 billion coming due.</p>\n<p>The post <a href=\"https://cryptoslate.com/americas-debt-machine-just-hit-368m-btc-this-years-surge-equals-100-years-of-new-bitcoin-supply/\">US debt hits 368M BTC: American debt machine adds a century worth of new Bitcoin supply this year alone</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>",
    "author": "Liam 'Akiba' Wright",
    "published_at": "2025-11-14T23:10:14",
    "categories": [
      "Analysis",
      "Featured",
      "Macro"
    ]
  },
  {
    "source": "CryptoSlate",
    "original_id": "https://cryptoslate.com/?p=507288",
    "title": "Ethereum Price Prediction 2025: ETH Dips to $3,200 on Holder Selling Frenzy, Whales Defy Losses—$EV2 Presale Ignites Gaming Rally",
    "link": "https://cryptoslate.com/ethereum-price-prediction-2025-eth-dips-to-3200-on-holder-selling-frenzy-whales-defy-losses-ev2-presale-ignites-gaming-rally/",
    "description": "<p>Ethereum has struggled to reclaim its recent high, and the price has gone down to below 3,200. Nevertheless, the trend is downward, and whales have been on a rise, with one of the biggest players contributing to their accounts in excess of 105M ETH. There is some division among analysts on the short-term prospects, with [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/ethereum-price-prediction-2025-eth-dips-to-3200-on-holder-selling-frenzy-whales-defy-losses-ev2-presale-ignites-gaming-rally/\">Ethereum Price Prediction 2025: ETH Dips to $3,200 on Holder Selling Frenzy, Whales Defy Losses—$EV2 Presale Ignites Gaming Rally</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>",
    "content": "<p>Ethereum has struggled to reclaim its recent high, and the price has gone down to below 3,200. Nevertheless, the trend is downward, and whales have been on a rise, with one of the biggest players contributing to their accounts in excess of 105M ETH.</p>\n<p>There is some division among analysts on the short-term prospects, with some forecasting that it may potentially rally to the $5,000 level by the end of 2025. As Ethereum consolidates, investors are eyeing the next big opportunity, and the <a href=\"https://ev2.funtico.com/?utm_source=cryptoslate.com&amp;utm_medium=Article&amp;utm_campaign=publishers\">Earth Version 2 ($EV2) </a> presale stands out as a promising contender in the GameFi space.</p>\n<h2>ETH Technicals Suggest Rebound: $3,570 Breakout or $2,800 Test?</h2>\n<p>Ethereum traders are facing fresh downside risks after the price dropped below $3,400. The token is currently priced at $3,211, representing a 10% decline over the last 24 hours and a 21% decrease in the past month. However, a whale has just bought 19,508 ETH for $61 million and now holds 405,238 ETH, despite incurring $126 million in unrealized losses. These moves show conviction in the chaos as exchange supply drops with 700,000 ETH <a href=\"https://www.tradingview.com/news/newsbtc:45ebb6b15094b:0-780m-worth-of-ethereum-pulled-from-exchanges-biggest-withdrawal-spike-in-weeks/\">withdrawn </a>recently.</p>\n<p>Technical indicators show a falling wedge pattern, with the MACD nearing a bullish crossover. Support is at $3,400, and resistance is at $3,570. A break above could target $3,640, but failure risks a slide to $3,260.</p>\n<figure class=\"wp-caption aligncenter\" id=\"attachment_507291\" style=\"width: 1024px;\"><img alt=\"ETH/USD falling wedge pattern. Source: TradingView\" class=\"wp-image-507291 size-large\" height=\"612\" src=\"https://cryptoslate.com/wp-content/uploads/2025/11/eth-trading-view-1024x612.jpg\" width=\"1024\" /><figcaption class=\"wp-caption-text\" id=\"caption-attachment-507291\">ETH/USD falling wedge pattern. Source: TradingView</figcaption></figure>\n<p>Derivatives activity increased, with volume up 27.6% to $139.7 billion, while <a href=\"https://www.coinglass.com/currencies/ETH\">open interest</a> fell about 7% to $37.8 billion. This mix often means that traders are closing positions during the decline instead of building new leverage.</p>\n<h2>Long-Term ETH Holders Step Up Selling</h2>\n<p>According to a Nov. 14 post on X by <a href=\"https://x.com/glassnode/status/1989208478565454099?s=20\">Glassnode</a>, long-term Ethereum holders have increased their selling activity over the past three months. Addresses holding ETH for 3 to 10 years have been moving or selling an average of over 45,000 ETH per day, based on the 90-day trend. This is the highest level of spending from this group since February 2021.</p>\n<figure class=\"wp-caption aligncenter\" id=\"attachment_507290\" style=\"width: 1024px;\"><img alt=\"ETH spent volume by age. Source Glassnode \" class=\"wp-image-507290 size-large\" height=\"585\" src=\"https://cryptoslate.com/wp-content/uploads/2025/11/eth-glassnode-1024x585.jpg\" width=\"1024\" /><figcaption class=\"wp-caption-text\" id=\"caption-attachment-507290\">ETH spent volume by age. Source Glassnode </figcaption></figure>\n<p>When long-term holders sell at this rate, it typically occurs when they decide to lock in profits or limit their exposure following a large rally. This could mean that ETH may need more time to steady before buyers step in again with confidence.</p>\n<p>CryptoQuant analysts also <a href=\"https://cryptoquant.com/insights/quicktake/6915e3021f27175f1a12e4f9-ETH-Net-Taker-Volume30ma-Still-Negative\">note </a>that Ethereum’s Net Taker Volume (30-day MA) is still negative. Selling pressure in the futures market has eased compared to September, but sellers are still stronger than buyers.</p>\n<p>In past market cycles, ETH would only find a bottom after this metric turned positive. Until then, the market will likely go sideways or down before forming a base.</p>\n<h2>$EV2 Presale Takes Center Stage: Top Gaming Bet for November</h2>\n<p>As the crypto market moves, presales are one of the best ways to get early exposure to high-upside projects. Among the top presales of November, <a href=\"https://ev2.funtico.com/?utm_source=cryptoslate.com&amp;utm_medium=Article&amp;utm_campaign=publishers\">Earth Version 2 ($EV2) </a>is the top gaming token.</p>\n<p><img alt=\"\" class=\"alignnone size-large wp-image-507289\" height=\"614\" src=\"https://cryptoslate.com/wp-content/uploads/2025/11/eth-ev2-1024x614.jpg\" width=\"1024\" /></p>\n<p>EV2 is a sci-fi-based, multiplayer online role-playing game that allows players to engage in various types of combat within a single game, including the Survival Match, a free-to-play, high-stakes mode.</p>\n<p>Players earn glowing cubes as they fight over valuable relics, and each moment in-game is exciting and rewarding. The game integrates blockchain with traditional gaming, allowing players to have real ownership of the in-game assets, such as Holocrons and tokens.</p>\n<p>Currently in <a href=\"https://ev2.funtico.com/\">presale</a>, $EV2 is available at $0.01, with a price increase to $0.015 as the presale progresses. The presale has already sold over 90,000 tokens. This may be the ideal time for early-stage investors to get in before the project is listed on public exchanges.</p>\n<p>The presale allows payments through ETH, USDT, BTC, and even credit cards, making it accessible to traditional gamers who are not familiar with cryptocurrency. What sets $EV2 apart is its focus on sustainability, blending DeFi and ReFi principles so players&#8217; rewards contribute positively to the environment. This is not only entertainment but an investment in the Web3 space.</p>\n<p>$EV2 possesses open tokenomics, which is a huge attraction to investors seeking transparent and equitable economic models. This predetermines the uniqueness of the offering in the gaming sphere, where the duality of in-game bonuses and cryptocurrency economy can provide both gamers and investors with new and thrilling experiences.</p>\n<h2>Final Thoughts: Bullish Close to 2025? $5K ETH and $EV2 Upside Await</h2>\n<p>Throughout the last months of 2025, Ethereum remains in a range of less than the $3,400 support price, and traders are looking forward to the possibility of a potential breakout. To be fresh, GameFi-style presale offers fresh convexity, making it easy to enter without the grind: early movers will receive 25% staking APYs before mainnet.</p>\n<p>Although Ethereum is facing pressure, it appears that $EV2 is a promising project that enables gamers to diversify and invest in the early stages of Web3 projects in the GameFi sector.</p>\n<p><strong>EV2 Presale</strong></p>\n<ul>\n<li>Website: <a href=\"https://ev2.funtico.com/\">https://ev2.funtico.com/</a></li>\n<li>Telegram: <a href=\"https://t.me/EV2_Official\">https://t.me/EV2_Official</a></li>\n<li>Twitter: <a href=\"https://x.com/EV2_Official\">https://x.com/EV2_Official</a></li>\n</ul>\n<p><em>Disclaimer: This is a sponsored post. CryptoSlate does not endorse any of the projects mentioned in this article. Investors are encouraged to perform necessary due diligence.</em></p>\n<p>The post <a href=\"https://cryptoslate.com/ethereum-price-prediction-2025-eth-dips-to-3200-on-holder-selling-frenzy-whales-defy-losses-ev2-presale-ignites-gaming-rally/\">Ethereum Price Prediction 2025: ETH Dips to $3,200 on Holder Selling Frenzy, Whales Defy Losses—$EV2 Presale Ignites Gaming Rally</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>",
    "author": "News Desk",
    "published_at": "2025-11-14T21:19:21",
    "categories": [
      "Sponsored"
    ]
  },
  {
    "source": "CryptoSlate",
    "original_id": "https://cryptoslate.com/?p=507212",
    "title": "Ripple won the fight—now it’s ghosting Wall Street despite a $40B IPO valuation",
    "link": "https://cryptoslate.com/ripple-won-the-fight-now-its-ghosting-wall-street-despite-a-40b-ipo-valuation/",
    "description": "<p>After defeating the US Securities and Exchange Commission over the status of XRP, Ripple has made a puzzling move: it’s not rushing to go public. Instead, the company is staying private. This choice says more about the uneasy fit between crypto firms and public markets than about Ripple’s finances. In July 2023, the court ruled [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/ripple-won-the-fight-now-its-ghosting-wall-street-despite-a-40b-ipo-valuation/\">Ripple won the fight—now it’s ghosting Wall Street despite a $40B IPO valuation</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>",
    "content": "<p>After defeating the US Securities and Exchange Commission over the status of <a href=\"https://cryptoslate.com/coins/xrp/\">XRP</a>, <a href=\"https://cryptoslate.com/companies/ripple/\">Ripple</a> has made a puzzling move: it’s not rushing to go public.</p>\n<p>Instead, the company is staying private. This choice says more about the uneasy fit between crypto firms and public markets than about Ripple’s finances.</p>\n<p>In July 2023, the court <a href=\"https://www.reuters.com/legal/us-judge-says-sec-lawsuit-vs-ripple-labs-can-proceed-trial-some-claims-2023-07-13/\">ruled</a> XRP was not a security when sold on public exchanges. This landmark victory cleared what many saw as the last major hurdle before a public offering.</p>\n<p>After years of litigation, Ripple emerged vindicated. By standard metrics, this was when a startup would capitalize, reward backers, tap capital markets, and become public.</p>\n<p>But Ripple declined. This month, the company confirmed it has &#8220;no plan, no timeline&#8221; for an IPO. President Monica Long stressed Ripple has about $500 million in funding and a private valuation near $40 billion. She believes Ripple doesn’t need public markets to grow.</p>\n<p>This choice sets Ripple apart from other crypto firms that went public and paid the price.</p>\n<h2>Coinbase, Robinhood, and the IPO cautionary tales</h2>\n<p><a href=\"https://cryptoslate.com/companies/coinbase/\">Coinbase’s</a> 2021 direct listing was seen as a milestone for crypto. For a while, it seemed a success. However, even as the broader crypto market gained momentum in 2025, Coinbase stock lagged behind, dropping approximately 30% earlier this year. This disconnect raises doubts about public markets’ ability to value crypto-native firms.</p>\n<p><a href=\"https://cryptoslate.com/companies/robinhood/\">Robinhood</a>, a major US crypto trading platform, faced similar trouble. Its 2021 IPO didn’t stabilize the stock. Market cycles, trading slumps, and regulatory questions eroded performance. Both companies gained short-term attention but long-term volatility.</p>\n<p>Ripple’s choice to stay private avoids this. Remaining off public markets shields it from earnings volatility and pressure from equity investors unfamiliar with crypto.</p>\n<p>The quarterly treadmill is brutal even for established firms. Crypto companies, with volatile revenues and regulatory exposure, are especially at risk.</p>\n<p>Ripple also holds a massive amount of XRP and relies heavily on its ecosystem. A public listing could create tension between token holders and equity investors, as seen elsewhere.</p>\n<p>Equity holders might push Ripple to monetize its XRP reserves or alter its value proposition. Staying private preserves flexibility and shields token management from public scrutiny.</p>\n<p>Regulatory uncertainty remains. Ripple won against the SEC, but the broader regulatory battle continues. The SEC pursues other crypto cases, and Congress lacks unified legislation. Going public could mean more disclosure and regulatory scrutiny. Staying private gives Ripple room to maneuver.</p>\n<p>Most importantly, Ripple doesn’t need the money. A $500 million raise at a $40 billion valuation means there will be no liquidity crunch. Private capital enables Ripple to scale without involving public investors or altering its internal governance.</p>\n<h2>A deeper tension between crypto and public markets</h2>\n<p>Ripple’s hesitation exposes an uncomfortable truth: public markets aren’t built for crypto-native companies. Traditional investors seek predictable earnings, stable margins, and regulatory clarity. Crypto firms ride volatile cycles, employ complex tokenomics, and operate in shifting legal zones.</p>\n<p>This mismatch matters. Public markets penalize companies when trading drops or regulation looms, even if core growth stays strong. Crypto firms aren’t rewarded for fundamentals like tech companies. Instead, they react to market sentiment and token prices.</p>\n<p>This means that a company’s core business, whether it involves enterprise blockchain services, custody infrastructure, or cross-border payments, can be overshadowed by token volatility or policy changes. In a private context, those risks are easier to manage. In a public context, they are often magnified or misunderstood.</p>\n<p>Expectations from token holders add complexity. Crypto users often act like shareholders without owning equity. They demand updates, align with projects, and object to perceived misalignment.</p>\n<p>Going public could force Ripple to balance between equity markets and token communities, a rare feat that few companies have successfully accomplished.</p>\n<p>Ripple’s move is a deliberate delay, not retreat. If it goes public, the landscape must change: clearer regulations, more informed investors, and a stable macro environment. Until then, staying private lets Ripple control its direction.</p>\n<p>The industry takeaway is clear: public listings aren’t guaranteed. Crypto firms must weigh timing, governance, and brand. With unconventional metrics and active communities, the bar for going public is higher.</p>\n<p>Ripple beat the SEC. But the fight for mainstream legitimacy and scaling remains. Dodging Wall Street, for now, may prove the smarter move.</p>\n<p>The post <a href=\"https://cryptoslate.com/ripple-won-the-fight-now-its-ghosting-wall-street-despite-a-40b-ipo-valuation/\">Ripple won the fight—now it’s ghosting Wall Street despite a $40B IPO valuation</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>",
    "author": "Andjela Radmilac",
    "published_at": "2025-11-14T21:00:15",
    "categories": [
      "Analysis",
      "Featured",
      "TradFi",
      "public listing",
      "Ripple",
      "Ripple IPO",
      "xrp"
    ]
  },
  {
    "source": "CryptoSlate",
    "original_id": "https://cryptoslate.com/?p=506609",
    "title": "These 3 Asian markets have switched on tokenized finance faster than the US",
    "link": "https://cryptoslate.com/these-3-asian-markets-have-now-switched-on-tokenized-finance-faster-than-the-us/",
    "description": "<p>Japan is advancing custody rules, Hong Kong is standardizing digitally native bond issuance, and Singapore has approved the first retail tokenized fund. The sequence is rules, issuance, and cash-like instruments. The link to crypto is not narrative but plumbing that reduces friction for collateral and settlement near BTC and ETH venues. Japan’s Financial Services Agency [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/these-3-asian-markets-have-now-switched-on-tokenized-finance-faster-than-the-us/\">These 3 Asian markets have switched on tokenized finance faster than the US</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>",
    "content": "<p>Japan is advancing custody rules, Hong Kong is standardizing digitally native bond issuance, and Singapore has approved the first retail tokenized fund.</p>\n<p>The sequence is rules, issuance, and cash-like instruments. The link to crypto is not narrative but plumbing that reduces friction for collateral and settlement near BTC and ETH venues.</p>\n<p>Japan’s Financial Services Agency set out a pathway that brings crypto closer to Financial Instruments and Exchange Act treatment while reaffirming hardware-segregated custody as the baseline.</p>\n<p>The agency’s <a href=\"https://www.fsa.go.jp/en/news/2025/20250410_2/02.pdf\">English discussion paper</a> cites more than 12 million exchange accounts and user assets exceeding ¥5 trillion held by exchanges as of January 2025, with cold wallets serving as the primary means of segregation.</p>\n<p>It also outlines information disclosure via exchanges for non-fundraising tokens, flags growth in decentralized exchanges and non-custodial wallets, and points to future alignment on insider-trading and market rules.</p>\n<p>According to the FSA paper, a 2025 bill to amend the Payment Services Act, including asset-location requirements and a new intermediary business category, has been submitted to the Diet.</p>\n<p>This approach reduces legal and operational uncertainty for banks and broker-dealers that have treated custody and liability as gating risks.</p>\n<p>If disclosures are channeled through exchanges for Type 2 tokens and conduct rules converge with the FIEA lens, distribution can expand without the need for bespoke frameworks per asset class.</p>\n<p>The practical outlet is broader menus on regulated platforms where BTC and ETH sit within a known disclosure and custody perimeter.</p>\n<h2>Balance sheet shift sets the demand backdrop</h2>\n<p>Japan’s household balance sheet, roughly ¥2,200 trillion in financial assets, adds latent firepower as the Bank of Japan anticipates portfolio shifts from deposits to investments as rates normalize.</p>\n<p>According to Reuters, the BOJ expects rising inflation to drive demand for new financial services, which could align with exchange distribution once the rules are settled.</p>\n<p>Hong Kong, in parallel, has moved from pilots to programmatic issuance of <a href=\"https://www.bloomberg.com/news/articles/2025-11-10/hong-kong-extends-digital-bond-ambitions-with-third-offering\">digitally native bonds</a>.</p>\n<p>The HKSAR Government’s multi-currency <a href=\"https://www.hkma.gov.hk/eng/news-and-media/press-releases/2024/02/20240207-6/\">HK$6 billion green bond</a> in 2024 was issued by HSBC Orion with settlement at T+1, compared to T+5 in conventional flows, and maintained compatibility with CMU and Euroclear-style infrastructure.</p>\n<p>According to the Hong Kong Monetary Authority, the <a href=\"https://www.hkma.gov.hk/media/eng/doc/key-functions/ifc/bond-market-development/Guideline_on_the_Digital_Bond_Grant_Scheme.pdf\">Digital Bond Grant Scheme</a> offsets origination and platform costs with grants up to HK$2.5 million per qualifying issuance, which lowers issuer hurdles and encourages repeat use of digital rails.</p>\n<p>Law firm notes from Linklaters and Ashurst document the first-of-its-kind corporate digitally native notes listed on the HKEX and Bank of Communications’ digitally native bonds in late 2024 and January 2025, expanding beyond sovereign issuance.</p>\n<p>The through-line is that DLT wallets and connectivity have moved into production finance.</p>\n<p>When settlement compresses from T+5 to T+1 and cash handling syncs with central market utilities, treasurers and funds keep wallets live for working balances and collateral.</p>\n<p>That adjacency matters for BTC and ETH because the same operational stack can support tokenized cash and credit lines that sit one hop away from crypto venues for hedging or treasury purposes.</p>\n<p>Securities Finance Times’ case material on Orion highlights the counterparty and margin savings that come from time compression, which is a direct cost argument rather than a branding exercise.</p>\n<h2>Policy scaffolding around settlement assets is also widening.</h2>\n<p>Hong Kong passed a stablecoin licensing bill in May 2025, creating a path for regulated issuers and a sandbox for rollouts.</p>\n<p>According to Reuters, the bill moves the jurisdiction closer to compliant settlement tokens that could sit alongside digitally native notes.</p>\n<p>If HKD or USD fully reserved stablecoins operate on the same rails that link to CMU, portfolio managers gain a clean route to park and mobilize balances.</p>\n<p>Those balances can also be held in crypto liquidity hubs without requiring excess reconciliation.</p>\n<p>Singapore added the consumer-grade piece: retail tokenized cash.</p>\n<p>The Monetary Authority of Singapore <a href=\"https://www.franklintempleton.com.sg/press-releases/franklin-templeton-receives-mas-approval-to-launch-first-retail-tokenized-fund-in-singapore\">approved</a> the Franklin OnChain U.S. Dollar Short-Term Money Market Fund for retail sale on May 15, 2025.</p>\n<p>Franklin’s transfer-agency stack issues tokenized shares in a VCC structure, and distribution can flow through local channels with standard investor protections.</p>\n<p>According to The Business Times, Singapore’s asset management industry reached S$6.07 trillion in 2024, a 12.2% increase year-over-year, providing a substantial domestic base for tokenized funds.</p>\n<p>Reuters reports that DBS, Franklin Templeton, and Ripple subsequently teamed up to list sgBENJI on DBS Digital Exchange in September 2025, with stated plans to use tokens as collateral and to execute swaps versus Ripple’s RLUSD stablecoin.</p>\n<h2>How new tokenized rails translate into crypto-market liquidity</h2>\n<p>This set of rails affects crypto through liquidity adjacencies rather than direct allocation mandates.</p>\n<p>If exchanges and prime brokers accept tokenized money market fund shares as collateral, users can toggle between cash-like tokens and BTC or ETH within a single operational perimeter.</p>\n<p>That compresses the basis, deepens the spot and derivatives depth, and reduces the need to move fiat off the platform.</p>\n<p>In Japan, exchange-held user assets exceeding ¥5 trillion represent existing custody that can be reweighted toward BTC and ETH once disclosure and market conduct rules are finalized.</p>\n<p>In Hong Kong, recurring digitally native bond issuance with T+1 settlement keeps institutional wallets active, making it easier to scale tokenized cash pools that can interact with crypto markets.</p>\n<p>In Singapore, retail-grade tokenized cash provides a base layer that can face banks and trading venues, moving beyond pilot-only gating.</p>\n<p>Plausibility ranges help quantify the runway over the next 12 to 24 months.</p>\n<p>If only 0.5% of Japan’s exchange-held assets are converted into BTC and ETH under more explicit rules, roughly ¥25 billion, or about US$165 million, would be added to spot demand.</p>\n<p>If new NISA-related flows bring another 1% to crypto allocations, that could add US$100 million to US$200 million, placing a base case between US$250 million and US$400 million.</p>\n<p>A cleaner legal landing that enables ETF-like wrappers could drive flows into the low single-digit billions of dollars over the next two years, consistent with the BOJ&#8217;s commentary on portfolio diversification.</p>\n<h2>Regulatory timing and issuance momentum as swing factors</h2>\n<p>If enforcement tightens around market integrity before new wrappers arrive, the impact could be flat to modestly positive.</p>\n<p>In Hong Kong, another HKSAR batch in the HK$5 billion to HK$10 billion range, plus two to four corporate digitally native notes at HK$1 billion to HK$3 billion each, would keep institutional wallets alive.</p>\n<p>If 1–2% of participating balances bridge into tokenized cash on the same rails, US$100 million to US$300 million could sit on-chain adjacent to crypto venues.</p>\n<p>A stronger outcome, aided by the Digital Bond Grant Scheme and stablecoin licensing, could propel total digital bond volume above HK$20 billion within a year and increase on-chain cash above US$500 million.</p>\n<p>If issuance momentum fades into proofs of concept, on-chain cash could remain below US$100 million with limited spillover.</p>\n<p>In Singapore, if 0.1% of S$6.07 trillion in AUM is allocated to tokenized cash and funds, approximately S$6 billion, or US$4.4 billion, would form a tokenized base.</p>\n<p>Even if only 2–5% of that base interacts as collateral near crypto, the effective liquidity adjacency would be about US$90 million to US$220 million.</p>\n<p>Wider collateralization of tokenized money market funds across banks would lift that figure, and Project Guardian&#8217;s links with foreign banks would expand distribution.</p>\n<p>A slow retail ramp, driven by suitability checks and onboarding, would push the impact below US$100 million.</p>\n<p>The global context supports scale.</p>\n<p>BCG and ADDX project that asset tokenization could reach approximately US$16.1 trillion by 2030, and BIS papers emphasize the importance of unified ledgers, legal certainty, and delivery-versus-payment designs that reduce settlement risk.</p>\n<p>The value proposition that resonated in Hong Kong’s digital bonds is concrete: T+5 to T+1, lower counterparty and margin costs, and compatibility with incumbent market utilities.</p>\n<h2>Regulatory timing will dictate how quickly these rails convert into usable liquidity</h2>\n<p>As these factors are codified in rules and grants in Asia’s three hubs, wallets and tokenized cash become standard operating tools rather than experiments, and crypto markets benefit from tighter spreads and deeper collateral pools as a byproduct.</p>\n<p>Below is a concise milestone table for reference.</p>\n<table>\n<thead>\n<tr>\n<th>Market</th>\n<th>Milestone (policy/rail)</th>\n<th>Date</th>\n<th>“So what” for crypto</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Japan</td>\n<td>FSA discussion paper (Eng.), disclosure classes, custody reaffirmed, 2025 PSA bill submitted</td>\n<td>Apr–Jul 2025</td>\n<td>Lower legal and ops risk, broader exchange products, smoother BTC and ETH distribution</td>\n</tr>\n<tr>\n<td>Hong Kong</td>\n<td>World’s first multi-currency digitally native green bond (HK$6bn) on Orion, DBGS subsidy</td>\n<td>Feb–Nov 2024</td>\n<td>T+1 settlement and cost reduction, grants tilt issuers to digital rails, persistent wallets</td>\n</tr>\n<tr>\n<td>Hong Kong</td>\n<td>Corporate digitally native notes on HKEX, BoCom digitally native bonds</td>\n<td>Sep 2024–Jan 2025</td>\n<td>Non-sovereign issuance de-risks rails through diversity of issuers</td>\n</tr>\n<tr>\n<td>Hong Kong</td>\n<td>Third HKSAR digital bond batch marketed</td>\n<td>Nov 2025</td>\n<td>More volume primes CMU-linked wallets near crypto venues</td>\n</tr>\n<tr>\n<td>Hong Kong</td>\n<td>Stablecoin licensing bill passed</td>\n<td>May 2025</td>\n<td>Regulated settlement tokens can operate alongside digital bonds</td>\n</tr>\n<tr>\n<td>Singapore</td>\n<td>First retail tokenized fund (Franklin OnChain MMF) approved by MAS</td>\n<td>May 2025</td>\n<td>Retail-grade on-chain cash, future collateral for crypto</td>\n</tr>\n<tr>\n<td>Singapore</td>\n<td>DBS, Franklin Templeton, Ripple list sgBENJI and outline collateralization</td>\n<td>Sept 2025</td>\n<td>Tokenized MMF as tradable collateral, tighter spreads</td>\n</tr>\n</tbody>\n</table>\n<p>According to HSBC’s digital bond case study, the operational delta is measurable in terms of time and margin, which is what scales when boards request repeatable savings.</p>\n<p>According to the HKMA’s grant program, issuers can recover up to HK$2.5 million per issuance, which turns pilot economics into routine issuance economics.</p>\n<p>According to the FSA, cold-wallet segregation remains the principle in Japan.</p>\n<p>According to The Business Times, Singapore’s AUM base is at a record level. These are the anchors that connect policy to flow.</p>\n<p>The immediate watchpoints are the FSA’s synthesis of public comments and movement on market conduct scope, the size and timing of Hong Kong’s third HKSAR batch, and DBGS uptake among corporates and SOEs, as well as the retail distribution of the Franklin fund, plus collateral acceptance beyond DBS under MAS’s Project Guardian umbrella.</p>\n<p>Hong Kong’s third HKSAR digital bond batch is now being marketed.</p>\n<p>The post <a href=\"https://cryptoslate.com/these-3-asian-markets-have-now-switched-on-tokenized-finance-faster-than-the-us/\">These 3 Asian markets have switched on tokenized finance faster than the US</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>",
    "author": "Liam 'Akiba' Wright",
    "published_at": "2025-11-14T19:00:41",
    "categories": [
      "Analysis",
      "In Focus",
      "Regulation",
      "RWA"
    ]
  },
  {
    "source": "CryptoSlate",
    "original_id": "https://cryptoslate.com/?p=507133",
    "title": "Grayscale’s IPO filing reveals strategic shift amid revenue dip",
    "link": "https://cryptoslate.com/grayscales-ipo-filing-reveals-strategic-shift-amid-revenue-dip/",
    "description": "<p>Grayscale filed an S-1 form with the Securities and Exchange Commission (SEC) on Nov. 13 to list Class A common stock on the New York Stock Exchange under ticker symbol GRAY. The firm manages approximately $35 billion across more than 40 crypto products, including spot Bitcoin and Ethereum ETFs. As a public company, Grayscale will [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/grayscales-ipo-filing-reveals-strategic-shift-amid-revenue-dip/\">Grayscale&#8217;s IPO filing reveals strategic shift amid revenue dip</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>",
    "content": "<p>Grayscale filed an S-1 form with the Securities and Exchange Commission (SEC) on Nov. 13 to list Class A common stock on the New York Stock Exchange under ticker symbol GRAY.</p>\n<p>The firm manages approximately $35 billion across more than 40 crypto products, including spot Bitcoin and Ethereum ETFs.</p>\n<p>As a public company, Grayscale will have to disclose more financials and face shareholder pressure, which could influence future fee decisions and product strategy.</p>\n<p>The filing does not specify share count or pricing range for the proposed offering. <a href=\"https://cryptoslate.com/companies/morgan-stanley/\">Morgan Stanley</a>, BofA Securities, Jefferies, and <a href=\"https://cryptoslate.com/companies/cantor-fitzgerald/\">Cantor</a> will serve as lead managing bookrunners.</p>\n<h2>Financial performance shows revenue pressure</h2>\n<p>Grayscale <a href=\"https://www.sec.gov/Archives/edgar/data/2073548/000119312525279127/ck0002073548-20251113.htm#prospectus_summary\">reported</a> $318.7 million in revenue for the nine months ended Sept. 30, down from $397.9 million in the same period of 2024. The company posted net income of $203.3 million through September 2025 compared with $223.7 million a year earlier.</p>\n<p>Operating margin reached 65.7% in the recent nine-month period.</p>\n<p>The firm&#8217;s weighted-average management fee declined to 1.39% through September 2025 from 1.67% in the prior-year period, reflecting competitive pressure from lower-cost ETF entrants, including <a href=\"https://cryptoslate.com/companies/blackrock/\">BlackRock</a> and <a href=\"https://cryptoslate.com/companies/fidelity-investments/\">Fidelity</a>.</p>\n<p>Average assets under management slipped to $30.6 billion from $31.8 billion year-over-year.</p>\n<p>Full-year 2024 results showed revenue of $506.2 million and net income of $282.1 million, down from $512.7 million and $325 million, respectively, in 2023. The company attributed the decline to reduced management fees, outflows, and distributions.</p>\n<h2>Dual-class structure preserves DCG control</h2>\n<p>The offering employs a dual-class share structure, giving <a href=\"https://cryptoslate.com/companies/digital-currency-group/\">Digital Currency Group</a>, Grayscale&#8217;s parent company, 10 votes per Class B share compared with one vote per Class A share.</p>\n<p>DCG will retain approximately 70% of total voting power after the IPO through its Class B holdings, which carry no economic rights. Each Class A share will receive one vote and full economic participation.</p>\n<p>The structure qualifies <a href=\"https://cryptoslate.com/companies/grayscale-investments/\">Grayscale</a> as a &#8220;controlled company&#8221; under NYSE rules, exempting it from certain corporate governance requirements. The Class B super-voting rights terminate when DCG&#8217;s ownership falls below 20% of total shares outstanding.</p>\n<h2>Impact on ETF holders remains indirect</h2>\n<p>The IPO does not alter the legal structure, custody arrangements, or operations of Grayscale&#8217;s existing trusts and ETFs.</p>\n<p>Fund assets remain held by third-party custodians under separate trust agreements.</p>\n<p>The company completed a reorganization into a Delaware holding structure earlier in 2025, which it stated would not materially affect trust operations.</p>\n<p>Net proceeds from the offering will be used to purchase membership interests from existing owners in Grayscale Operating, rather than funding capital expenditures.</p>\n<p>The transaction converts private ownership stakes into publicly tradable equity without requiring the injection of new capital into fund operations or altering sponsor fee arrangements.</p>\n<p>Grayscale reserved a portion of IPO shares for eligible investors in its <a href=\"https://cryptoslate.com/coins/bitcoin/\">Bitcoin</a> Trust ETF (<a href=\"https://cryptoslate.com/products/grayscale-bitcoin-trust/\">GBTC</a>) and <a href=\"https://cryptoslate.com/coins/ethereum/\">Ethereum</a> Trust ETF (<a href=\"https://cryptoslate.com/products/grayscale-ethereum-trust/\">ETHE</a>) through a directed share program.</p>\n<p>Participants must have held GBTC or ETHE shares as of Oct. 28 and complete pre-registration by Nov. 24. The program does not guarantee allocations, and shares purchased through it face no lock-up restrictions.</p>\n<p>The public listing will subject Grayscale to quarterly and annual reporting requirements, providing ETF investors with increased visibility into the sponsor&#8217;s financial condition, litigation exposure, and product concentration.</p>\n<p>The registration statement indicates that future fee decisions and product expansion plans will face scrutiny from public equity holders alongside existing competitive pressure in the ETF market.</p>\n<p>The post <a href=\"https://cryptoslate.com/grayscales-ipo-filing-reveals-strategic-shift-amid-revenue-dip/\">Grayscale&#8217;s IPO filing reveals strategic shift amid revenue dip</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>",
    "author": "Gino Matos",
    "published_at": "2025-11-14T17:00:01",
    "categories": [
      "Crypto",
      "ETF",
      "In Focus",
      "Regulation"
    ]
  },
  {
    "source": "CryptoSlate",
    "original_id": "https://cryptoslate.com/?p=507118",
    "title": "EU shock Bitcoin move: A European central bank quietly bought BTC despite ECB’s hard “No”",
    "link": "https://cryptoslate.com/eu-shock-bitcoin-move-a-european-central-bank-quietly-bought-btc-despite-ecbs-hard-no/",
    "description": "<p>Earlier in the year, Europe&#8217;s Central Bank (ECB) President Christine Lagarde insisted that Bitcoin would not be included in the reserve portfolios of central banks under the ECB’s umbrella; the statement was intended to draw a firm boundary around sovereign engagement with digital assets. For more than two decades, reserve cohesion has served as a [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/eu-shock-bitcoin-move-a-european-central-bank-quietly-bought-btc-despite-ecbs-hard-no/\">EU shock Bitcoin move: A European central bank quietly bought BTC despite ECB’s hard &#8220;No&#8221;</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>",
    "content": "<p>Earlier in the year, <a href=\"https://cryptoslate.com/ecb-will-assess-ties-with-national-banks-holding-bitcoin-reserves/\">Europe&#8217;s Central Bank (ECB)</a> President Christine Lagarde insisted that Bitcoin would not be included in the reserve portfolios of central banks under the ECB’s umbrella; the statement was intended to draw a firm boundary around sovereign engagement with digital assets.</p>\n<p>For more than two decades, reserve cohesion has served as a marker of European stability, with eurozone institutions typically presenting a united front on monetary doctrine questions.</p>\n<p>Yet within the same year, the <a href=\"https://cryptoslate.com/czech-national-bank-considers-bitcoin-for-reserve-diversification/\">Czech National Bank</a> introduced an unexpected complication, not through debate or public dissent, but through a modest transaction that quietly expanded the technical perimeter of European reserve management.</p>\n<p>On Nov. 13, the CNB <a href=\"https://www.cnb.cz/en/cnb-news/press-releases/The-CNB-creates-a-test-portfolio-of-digital-assets/\">confirmed</a> that it had acquired roughly $1 million in <a href=\"https://cryptoslate.com/coins/bitcoin/\">Bitcoin</a>, USD-backed stablecoins, and a tokenized deposit, placing the assets in a dedicated “test portfolio” designed to evaluate custody, valuation, compliance, and settlement procedures.</p>\n<p>The bank’s leadership emphasized that the purchase would not be incorporated into official reserves and was not intended to signal any policy shift.</p>\n<p>However, the act of conducting the experiment and doing so with live assets rather than laboratory models marks the first time an EU-member central bank has created and disclosed an operational framework capable of <a href=\"https://cryptoslate.com/luxembourg-sets-precedent-with-first-eurozone-bitcoin-allocation-in-national-fund/\">supporting Bitcoin at a sovereign scale</a>.</p>\n<p>That alone is enough to alter how markets interpret Bitcoin’s long-term role in the global financial system.</p>\n<h2>A test portfolio that expands the boundaries of what Bitcoin represents</h2>\n<p>The importance of the Czech pilot lies less in its size than in the infrastructure it puts into motion. Central banks regularly conduct internal analysis on new asset classes, but they rarely build a complete operational workflow unless they believe that such capabilities may eventually be required.</p>\n<p>In this case, the CNB is examining the full suite of procedures necessary for managing digital instruments under reserve-grade scrutiny: secure key management, multi-layer approval chains, AML verification standards, crisis-response simulations, mark-to-market reconciliation, and integration with established reporting frameworks.</p>\n<p>These processes are difficult to design and expensive to maintain, which is precisely why institutions do not establish them unless they anticipate that the underlying asset may become relevant in scenarios where preparation matters more than public signaling.</p>\n<p>Once a central bank possesses the architecture to store and manage Bitcoin, the distinction between “test asset” and “reserve asset” becomes a matter of policy choice rather than operational feasibility.</p>\n<p>For markets, this changes <a href=\"https://cryptoslate.com/france-wants-to-tax-unrealized-crypto-holdings-but-also-hoard-420000-btc/\">Bitcoin’s position in the sovereign selectorate.</a> The asset shifts from being a conceptual outlier to a technically viable option whose adoption probability, however small today, is no longer zero.</p>\n<p>Pricing models for long-duration assets respond to possibility as much as reality, and Bitcoin is particularly sensitive to changes in perceived legitimacy because a significant portion of its valuation has always reflected expectations about its future monetary relevance rather than current institutional participation.</p>\n<h2>How Prague’s move reshapes the market narrative around Bitcoin</h2>\n<p>The Czech experiment arrives at a moment when Bitcoin’s macro profile is already evolving, driven by ETF inflows, expanding liquidity, and a growing body of historical data about its correlation behavior under different rate environments.</p>\n<p>What the CNB adds to that landscape is an entirely different form of signal: a sovereign institution treating Bitcoin as an instrument demanding operational mastery, even without committing to eventual adoption.</p>\n<p>This reframing matters because central banks influence markets not only through their purchases but through the categories they create.</p>\n<p>Therefore, when Bitcoin enters the realm of assets that a central bank must understand, it establishes a structural foothold in the global financial architecture.</p>\n<p>For traders, the significance lies not in the Czech Republic suddenly accumulating a meaningful position, but in Bitcoin having crossed into the class of instruments that sovereign institutions are preparing to interact with if conditions change.</p>\n<p>That preparation introduces what some macro analysts describe as a “sovereign option premium”: a valuation component reflecting the non-zero probability that future reserve diversification, stress-hedging, or geopolitical responses could involve digital assets.</p>\n<p>Even if no central bank adopts Bitcoin in the near term, the act of operational testing reduces the asset’s existential risk profile and the fear that governments would remain universally hostile or permanently structurally excluded from interacting with it. In asset-pricing models, lower existential risk translates into higher long-term fair value.</p>\n<p>This mechanism explains why a small, symbolic purchase can reshape Bitcoin’s strategic narrative without directly affecting its liquidity. Sovereign institutions rarely begin with large allocations; instead, they start with the infrastructure that enables them to act without improvisation.</p>\n<p>Thus, the Czech step signals that Bitcoin has entered this preparatory phase, and markets tend to anticipate the implications of such transitions long before they occur.</p>\n<h2>Longer-term impact on BTC</h2>\n<p>The Czech Republic occupies a unique institutional position. It is bound by EU regulation, including MiCA, but operates outside the eurozone and thus retains full autonomy over its reserve composition.</p>\n<p>Historically, non-Euro EU members have informally aligned with ECB reserve norms in the interest of maintaining credibility and cohesion; however, the absence of formal enforcement mechanisms has meant that such alignment has always been voluntary.</p>\n<p>The CNB’s experiment does not constitute a break with the ECB. Yet, it demonstrates the limits of centralized guidance in an era when inflation cycles, debt dynamics, and technological change encourage reserve managers to pursue a broader palette of options.</p>\n<p>For Bitcoin, this creates an important precedent. Europe is the world’s second-largest reserve bloc, and even minor shifts in its analytical posture can influence global perceptions of what constitutes a legitimate sovereign asset.</p>\n<p>Suppose other non-Euro EU central banks or mid-sized institutions outside Europe, facing similar diversification pressures, replicate the Czech approach. In that case, Bitcoin’s sovereign thesis will mature more quickly than policy statements alone would suggest.</p>\n<p>Central banks do not need to adopt Bitcoin for the asset to benefit from the operational normalization underway. They need only acknowledge that the capacity to manage it is part of their institutional toolkit.</p>\n<p>The CNB has not signaled any intention to add Bitcoin to official reserves, and its leadership remains aligned with <a href=\"https://cryptoslate.com/will-eu-sanctions-choke-ruble-stablecoin-routes-into-bitcoin/\">Europe’s cautious stance on digital assets</a>. Even so, the act of building the infrastructure subtly changes the baseline from which future decisions will be made.</p>\n<p>In that sense, the <a href=\"https://cryptoslate.com/bitcoin-leads-2-8-billion-profit-wave-amid-market-contraction-concerns-glassnode-data-shows/\">impact on Bitcoin</a> is less about immediate demand and more about the narrative foundation it gains from being treated as a reserve-relevant instrument. Markets understand this dynamic well: institutional readiness is often the earliest indicator of eventual adoption, even if actual positions come years later.</p>\n<p>Bitcoin’s long-term valuation models now incorporate the reality that at least one European central bank has decided the asset deserves operational competence rather than rhetorical dismissal.</p>\n<p>The post <a href=\"https://cryptoslate.com/eu-shock-bitcoin-move-a-european-central-bank-quietly-bought-btc-despite-ecbs-hard-no/\">EU shock Bitcoin move: A European central bank quietly bought BTC despite ECB’s hard &#8220;No&#8221;</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>",
    "author": "Oluwapelumi Adejumo",
    "published_at": "2025-11-14T15:00:58",
    "categories": [
      "Adoption",
      "Crypto",
      "In Focus",
      "Treasuries",
      "bitcoin",
      "czech",
      "eu"
    ]
  },
  {
    "source": "CryptoSlate",
    "original_id": "https://cryptoslate.com/?p=507175",
    "title": "US inflation data goes dark: Shutdown wipes out October CPI, leaving Bitcoin hanging",
    "link": "https://cryptoslate.com/cpi-goes-dark-shutdown-wipes-out-october-cpi-leaving-bitcoin-hanging/",
    "description": "<p>For months, crypto traders have timed leverage, funding, and liquidity around the monthly U.S. inflation print. This week, those who had hoped the recent vote to reopen the government would bring new macro data were disappointed to find nothing on the tape. The Bureau of Labor Statistics said in October that &#8220;No other releases will [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/cpi-goes-dark-shutdown-wipes-out-october-cpi-leaving-bitcoin-hanging/\">US inflation data goes dark: Shutdown wipes out October CPI, leaving Bitcoin hanging</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>",
    "content": "<p>For months, crypto traders have timed leverage, funding, and liquidity around the monthly U.S. inflation print.</p>\n<p>This week, those who had hoped the recent vote to <a href=\"https://cryptoslate.com/btc-targets-cme-gap-at-104000-as-shutdown-end-buoys-risk/\">reopen</a> the government would bring new macro data were disappointed to find nothing on the tape. The Bureau of Labor Statistics <a href=\"https://www.bls.gov/bls/092025-cpi-reschedule-notice.htm\">said</a> in October that</p>\n<blockquote><p>&#8220;No other releases will be rescheduled or produced until the resumption of regular government services.&#8221;</p></blockquote>\n<p>The last completed CPI report, covering September, was released late on October 24, following the shutdown&#8217;s interruption of normal operations.</p>\n<p>The all-items index level came in at 324.80, with headline and <a href=\"https://tradingeconomics.com/united-states/core-inflation-rate\">core inflation</a> both at 3.0% year-over-year. <a href=\"https://tradingeconomics.com/united-states/inflation-cpi\">Trading Economics</a> currently lists December 10 as the next scheduled date on the CPI calendar.</p>\n<h2>Why the Missing October Print Matters for Markets</h2>\n<p>There is now a gap for October that may never be filled. Because the shutdown covered the full data-collection period, field staff were unable to gather the price sample that underpins CPI. That may be collated and included in the December update, but the <a href=\"https://fortune.com/2025/11/13/october-2025-jobs-inflation-data-release-government-shutdown/\">indication</a> is that there will now be a gap.</p>\n<p>White House Press Secretary <a href=\"https://www.youtube.com/watch?app=desktop&amp;v=JdjcYPRe-8M\">blamed the gap</a> on the Democrats, asserting,</p>\n<blockquote><p>&#8220;The Democrats may have permanently damaged the Federal Statistical System with October CPI and jobs reports likely never being released.&#8221;</p></blockquote>\n<p>Without that survey, the BLS could not post an update on Nov. 13, the standard date when markets would have received the October reading. Officials have signaled that October may not be reconstructable even after operations return to normal, as there is no primary data to benchmark against.</p>\n<p>For crypto markets, the absence of a number mattered more than any hypothetical value. Bitcoin and Ethereum entered the week positioned for a volatility event that never materialized. Though volatility came regardless.</p>\n<p>Spot Bitcoin fell around 6% over the session, along with a <a href=\"https://cryptoslate.com/why-is-everything-down-macro-shock-turns-bitcoin-and-other-risk-assets-red-across-the-board/\">sea of red</a> across the entire crypto market. Liquidity remains thin, and derivatives open interest edged lower, a behavior that aligns with a market waiting for macroeconomic information that did not materialize.</p>\n<p>The missing CPI broke the usual chain that connects inflation data to crypto price action.</p>\n<p>Normally, a softer print feeds expectations for a less restrictive Federal Reserve path. Treasury yields edge down, the dollar weakens, and risk assets, including <a href=\"https://cryptoslate.com/coins/bitcoin\">Bitcoin</a>, catch a bid.</p>\n<p>A hotter print does the opposite, firming expectations for tighter policy and pressuring long-duration assets.</p>\n<p>With no data, rates desks had no fresh input for real yields or breakeven inflation. The Fed outlook shifts to a trade on speeches, market-based inflation swaps, and secondary indicators.</p>\n<p>That macro vacuum pushed crypto further into its role as a proxy for expectations about future policy rather than a simple high-beta extension of equities.</p>\n<p>Without CPI, desks leaned more on liquidity, ETF flows, and options positioning. Funding rates on major futures pairs compressed as new directional leverage stayed on the sidelines.</p>\n<p>All of this redirects attention to Dec. 10, the next date on the CPI calendar. Trading Economics lists that day as the “next release,” although the value field is empty, emphasizing that it is a placeholder rather than a confirmed dataset.</p>\n<h2>The Market Impact of October’s Unfillable CPI Gap</h2>\n<p>Markets now have to price three broad paths for what that date could bring.</p>\n<p>One path is for the BLS to manage the reconstruction of some form of October CPI using partial samples, imputation, or model-based estimates.</p>\n<p>If that happens, traders may treat the number as lower quality than a normal print, since the underlying survey would not follow the standard methodology. Reaction in crypto could be modest.</p>\n<p>If the headline monthly change lands at 0.2% or below, consistent with a controlled disinflation trend, the usual pattern would be dollar softness, a pullback in yields, and a Bitcoin bounce.</p>\n<p>Ethereum is likely to outperform over the next one to two days as traders re-engage with higher-beta risk. Smaller altcoins tend to follow, often moving in the 5–12% range once liquidity shifts down the risk curve.</p>\n<p>If the reconstructed number or a clean November print falls in a “sticky” zone around 0.3–0.4% month-on-month, the message for policy becomes less clear.</p>\n<p>Yields may move in a narrow range, and crypto could end the day close to where it started. Bitcoin may trade flat, with altcoins underperforming as traders cut marginal risk.</p>\n<p>Funding rates in perpetual futures could slide into slightly negative territory as short-term hedging flows dominate.</p>\n<p>A third path is that inflation data comes in hot at 0.5% or above. That outcome would strengthen expectations that the Fed needs to keep policy tight for longer, pulling the dollar higher and pushing Treasury yields up across the curve.</p>\n<p>In previous episodes, such combinations have been associated with a 3–6% intraday drop in Bitcoin, sharper moves in Ethereum, and a broad deleveraging in altcoins.</p>\n<p>Liquidation volumes in such washouts often run two to four times above recent norms as overleveraged positions are forced out.</p>\n<h2>How the CPI Void Reshapes Short-Term Macro Trading</h2>\n<p>The more unusual scenario is that Dec. 10 arrives with no October CPI at all because the BLS decides the missing survey cannot be credibly reconstructed or additional delays occur in the pipeline.</p>\n<p>In that world, the next clean reading would reflect November conditions, and the gap between hard inflation data points would stretch to almost two months.</p>\n<p>Treasuries would need to lean more heavily on breakeven markets and inflation swaps to anchor expectations. The term&#8217; premium across the curve&#8217; could embed a fatter risk buffer for the uncertainty surrounding true price dynamics.</p>\n<p>Trading Economics currently forecasts continued inflation pressure into next year, with CPI rising month-on-month.</p>\n<figure class=\"wp-caption aligncenter\" id=\"attachment_507184\" style=\"width: 1024px;\"><img alt=\"US CPI forecast (Source: TradingEconomics)\" class=\"wp-image-507184 size-large\" height=\"541\" src=\"https://cryptoslate.com/wp-content/uploads/2025/11/Screenshot-2025-11-14-at-09.53.24-1024x541.png\" width=\"1024\" /><figcaption class=\"wp-caption-text\" id=\"caption-attachment-507184\">US CPI forecast (Source: TradingEconomics)</figcaption></figure>\n<p>For digital assets, a world with unreliable or irregular inflation data introduces a new kind of macro regime.</p>\n<p>Crypto becomes more of a “macro-smoothed” asset class, trading on slower-moving forces such as ETF flows, structural demand from long-only allocators, corporate balance sheet decisions, and the plumbing of dollar liquidity.</p>\n<p>Short-term volatility driven by scheduled data would fall, replaced by longer episodes of uncertainty punctuated by policy communication and idiosyncratic crypto events.</p>\n<p>That regime would likely reinforce Bitcoin’s status as the sector’s benchmark. When macroeconomic uncertainty is high but data are sparse, traders have a lower appetite for tokens farther out on the risk spectrum.</p>\n<p>Capital tends to consolidate into assets with deeper liquidity, clearer narratives, and more developed derivatives markets. Altcoins that rely on high leverage or speculative momentum for price support may find these conditions scarce until regular macroeconomic releases resume.</p>\n<p>The CPI gap also elevates the importance of alternative data sources and nowcasting models that attempt to infer inflation from high-frequency inputs such as card spending, freight rates, or online prices.</p>\n<p>Traditional macro desks already track those indicators, but without a monthly BLS checkpoint, they carry more weight.</p>\n<p>Crypto traders may have to incorporate such tools more systematically if the formal inflation pipeline remains unstable.</p>\n<p>For now, the CPI story is not about an upside or downside surprise but about an empty line in the macro calendar.</p>\n<p>The last confirmed reading shows a 324.80 index level for September with 3.0% inflation on both headline and core measures.</p>\n<p>The next entry is a blank field on Dec. 10 that may or may not contain October’s missing data. Crypto markets are trading around this absence, waiting to see whether the world’s most-watched inflation gauge reappears or whether the macro vacuum persists.</p>\n<p>The post <a href=\"https://cryptoslate.com/cpi-goes-dark-shutdown-wipes-out-october-cpi-leaving-bitcoin-hanging/\">US inflation data goes dark: Shutdown wipes out October CPI, leaving Bitcoin hanging</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>",
    "author": "Liam 'Akiba' Wright",
    "published_at": "2025-11-14T13:00:58",
    "categories": [
      "Featured",
      "Macro",
      "Market"
    ]
  },
  {
    "source": "CryptoSlate",
    "original_id": "https://cryptoslate.com/?p=507057",
    "title": "Bitcoin tests the $95k HODL wall after cascade knocks out $655M from bulls",
    "link": "https://cryptoslate.com/bitcoin-tests-the-95k-hodl-wall-after-cascade-knocks-out-655m-from-bulls/",
    "description": "<p>Bitcoin has done what many bulls dreaded: it plunged below six figures, crashed through $100,000, and even tumbled past $98,000 in a wave of liquidations not seen since May. As reported by CryptoSlate, BTC fell to $98,550, triggering $190 million in long liquidations in one hour and $655 million in 24 hours as spot ETFs [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/bitcoin-tests-the-95k-hodl-wall-after-cascade-knocks-out-655m-from-bulls/\">Bitcoin tests the $95k HODL wall after cascade knocks out $655M from bulls</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>",
    "content": "<p><a href=\"https://cryptoslate.com/coins/bitcoin/\">Bitcoin</a> has done what many bulls dreaded: it plunged below six figures, crashed through $100,000, and even tumbled past $98,000 in a wave of liquidations not seen since May.</p>\n<p>As <a href=\"https://cryptoslate.com/bitcoin-loses-its-last-line-of-defense-98k-breakdown-sparks-cascade-not-seen-since-may/\">reported</a> by <em>CryptoSlate</em>, BTC fell to $98,550, triggering $190 million in long liquidations in one hour and $655 million in 24 hours as spot ETFs saw a $278 million net outflow on Nov. 12 and $961 million for the month so far.</p>\n<figure class=\"wp-caption aligncenter\" id=\"attachment_507191\" style=\"width: 1534px;\"><img alt=\"BTC USD price\" class=\"size-full wp-image-507191\" height=\"818\" src=\"https://cryptoslate.com/wp-content/uploads/2025/11/BTCUSD_2025-11-14_12-01-03.png\" width=\"1534\" /><figcaption class=\"wp-caption-text\" id=\"caption-attachment-507191\">Graph showing Bitcoin&#8217;s price on Coinbase from Nov. 13 to Nov. 14, 2025 (Source: <a href=\"https://www.tradingview.com/chart/nDPOT2hW/\">TradingView</a>)</figcaption></figure>\n<p>This event shifted a slow decline into a sharp drop, clearing leveraged longs and forcing the market to face the on-chain support below the price.</p>\n<h2>On-chain data reveals shifting market structure beneath $100k</h2>\n<p>Coinbase data showed the extent of the move in the US after liquidations began. Bitcoin peaked at $103,988 before falling to $95,900, last closing near $96,940: barely 2% above $95,000, the on-chain HODLers Wall. The market fell from a 5% cushion above the wall to nearly touching it.</p>\n<p>The on-chain wall’s structure remains, but price behavior has changed. Cost-basis distribution shows that approximately 65% of all invested USD in Bitcoin is above $95,000, with every short-term holder&#8217;s coin priced there or higher, and 30% of the long-term holder supply in the same range.</p>\n<figure class=\"wp-caption aligncenter\" id=\"attachment_507190\" style=\"width: 1898px;\"><img alt=\"btc invested value by cohort\" class=\"size-full wp-image-507190\" height=\"851\" src=\"https://cryptoslate.com/wp-content/uploads/2025/11/Screenshot-2025-11-14-at-11.58.28.png\" width=\"1898\" /><figcaption class=\"wp-caption-text\" id=\"caption-attachment-507190\">Chart showing the value invested in Bitcoin by cohort as of Nov. 12, 2025 (Source: <a href=\"https://charts.checkonchain.com/btconchain/urpd/urpd_realised_cohort/urpd_realised_cohort_light.html\">Checkonchain</a>)</figcaption></figure>\n<p>This isn’t the thin, speculative air of 2017’s top or the initial 2021 peak. It’s similar to the denser “second-wind” structure of late 2021, where seasoned holders and new entrants shared the topping zone, and resolution took months.</p>\n<p>That density explains why spot has dragged for so long. The US election rally last year pulled a broad swath of buyers into the $95k–$115k range and trapped them through a year of sideways trading.</p>\n<p>With the short-term holder cost basis already breached at about $112,000, every failed attempt to recover that level trapped more recent buyers underwater while long-term holders sat on a layered cost-basis ladder just below the highs.</p>\n<h2>Futures unwind and ETF outflows reveal a thinning support zone</h2>\n<p>The latest cascade exposed that structure: once futures longs started to unwind, there was very little fresh demand between the $106k-$118k resistance area that Glassnode flagged and the psychological $100k handle, and ETF demand was no longer strong enough to absorb forced selling.</p>\n<p>The key difference now is who’s selling. In 2017 and 2021, supply near the top was mostly from short-term holders. After those peaks, older, in-profit coins rotated out. Then, unrealized losses reached 15% of the market cap within six weeks, filling old air pockets.</p>\n<p>In 2025, unrealized losses are about half what they were in January 2022, despite BTC trading under $100k and touching the wall.</p>\n<p>Glassnode data shows STHs have been underwater against their $111,900 cost basis since October. Their realized profit-loss ratio fell below 0.21 near $98,000, meaning over 80% of the value they moved there was sold at a loss.</p>\n<p>This is classic capitulation by top buyers, not a broad LTH exit. Checkonchain confirms: almost half the coins recently sold came from high-entry, recent buyers exiting as the market hovers near the wall.</p>\n<p>That’s why $95k still matters. It was a theoretical bull cycle “fail point”; now the price nears it. New Coinbase data shows that BTC’s $95,900 low places it deep within the long-term holder zone, where most coins remain unmoved. If this group stays firm, the wall can absorb forced STH and derivatives selling.</p>\n<p>However, if Bitcoin cleanly loses $95,000, the roadmap is reasonably clear. The first shelf sits around $85,000, the “tariff tantrum” low, where spot hammered out a local bottom during earlier policy jitters and briefly refilled part of last year’s air pocket.</p>\n<p>Below that is the True Market Mean at $82,000, which sits directly over the residual gap from the US election pump and would be a natural magnet for a deeper flush. Only beyond those levels does the large, older demand band between $50,000 and $75,000 re-enter the conversation.</p>\n<h2>How this cycle’s risk profile differs from 2022</h2>\n<p>There is another key difference from 2022 that the current price action has not undone.</p>\n<p>Back then, the loss of the $45k base of that cycle’s HODLers Wall was swift and brutal: STH cost basis gave way at $54k, the wall at $45k offered almost no support, and the market spilled straight down to the True Market Mean around $36k, intersecting a multi-year air-pocket that went all the way back to the start of the cycle.</p>\n<p>In this cycle, the potential fall from the wall to the mean is much shorter, and the underlying demand from the 2024 range is closer in price. A move from $95k to the low-$80ks would hurt, but it would not recreate the kind of deep, multi-year bear that followed the 2021 peaks.</p>\n<p>The short-term backdrop remains fragile. ETF flows tilt negative, redemptions replacing the steady inflows that supported Bitcoin for most of the year. Perpetual funding and open interest have declined since October’s leverage flush. Options markets now pay an 11% implied volatility premium for puts over calls, signaling traders are hedging for downside.</p>\n<p>What happens next depends less on short-term traders than on the holders who own the bulk of the supply above and just below $95k.</p>\n<p>If they hold their nerve, the wall can continue to act as a floor, giving the market time to rebuild demand. If they crack, the path through $85k and down toward the $82k mean is already drawn on the on-chain chart.</p>\n<p>The post <a href=\"https://cryptoslate.com/bitcoin-tests-the-95k-hodl-wall-after-cascade-knocks-out-655m-from-bulls/\">Bitcoin tests the $95k HODL wall after cascade knocks out $655M from bulls</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>",
    "author": "Andjela Radmilac",
    "published_at": "2025-11-14T11:45:14",
    "categories": [
      "Analysis",
      "Derivatives",
      "In Focus",
      "Market",
      "bitcoin",
      "BTC",
      "hodlers wall",
      "liquidation cascade",
      "long-term holder supply",
      "price action",
      "short-term hodler cost basis"
    ]
  },
  {
    "source": "CryptoSlate",
    "original_id": "https://cryptoslate.com/?p=507174",
    "title": "Why is everything down? Macro shock turns Bitcoin and other risk assets red across the board",
    "link": "https://cryptoslate.com/why-is-everything-down-macro-shock-turns-bitcoin-and-other-risk-assets-red-across-the-board/",
    "description": "<p>Equity screens show a broad red, with the S&#38;P 500 down around 1.8% and the entire crypto market under pressure simultaneously. What appears to be an unexplained wipeout is, in fact, a layered move driven by interest rate expectations, crowded positioning in tech and AI names, and a shift in global risk appetite that is [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/why-is-everything-down-macro-shock-turns-bitcoin-and-other-risk-assets-red-across-the-board/\">Why is everything down? Macro shock turns Bitcoin and other risk assets red across the board</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>",
    "content": "<p>Equity screens show a broad red, with the S&amp;P 500 down around 1.8% and the entire crypto market under pressure simultaneously.</p>\n<p>What appears to be an unexplained wipeout is, in fact, a layered move driven by interest rate expectations, crowded positioning in tech and AI names, and a shift in global risk appetite that is pulling liquidity from the parts of the market that led the prior rally.</p>\n<p>Across crypto, the tape was heavy over the last 24 hours: <a href=\"https://cryptoslate.com/coins/bitcoin\">Bitcoin</a> -5.8%, <a href=\"https://cryptoslate.com/coins/ethereum\">Ethereum</a> -9.4%, <a href=\"https://cryptoslate.com/coins/xrp\">XRP</a> -8.8%, <a href=\"https://cryptoslate.com/coins/solana\">Solana</a> -9.2%, and <a href=\"https://cryptoslate.com/coins/bnb\">BNB</a> -5.2%. As a result, the total market cap fell by 6% to $3.2 trillion from around $3.4 trillion.</p>\n<figure class=\"wp-caption aligncenter\" id=\"attachment_507177\" style=\"width: 1024px;\"><img alt=\"Crypto market heatmap (Source: TradingView)\" class=\"wp-image-507177 size-large\" height=\"469\" src=\"https://cryptoslate.com/wp-content/uploads/2025/11/Screenshot-2025-11-14-at-09.56.15-1024x469.png\" width=\"1024\" /><figcaption class=\"wp-caption-text\" id=\"caption-attachment-507177\">Crypto market heatmap (Source: TradingView)</figcaption></figure>\n<p>Over $1.1 billion was wiped out from futures markets, according to CoinGlass data, with over $500 million liquidated from Bitcoin positions alone.</p>\n<h2>Tightening financial conditions reverberate through growth assets.</h2>\n<p>The first piece sits with the Federal Reserve. Markets spent much of the year pricing in a clear path toward rate cuts and a softer stance on policy.</p>\n<p>Recent communication has pushed back on that comfort, with officials leaning toward keeping policy tight for longer and treating incoming data with caution.</p>\n<p>Investors had built in a faster easing path, and the adjustment toward fewer or later cuts has pushed yields higher across the curve.</p>\n<p>Higher real yields compress the present value of long-dated cash flows, which hits growth stocks and long-duration assets and pulls forward the valuation reset that had been delayed by abundant liquidity.</p>\n<p>That repricing feeds directly into the sector that carried much of the index-level gains. The latest leg of the S&amp;P 500 move was led by mega-cap tech and AI-related names.</p>\n<figure class=\"wp-caption aligncenter\" id=\"attachment_507178\" style=\"width: 1024px;\"><img alt=\"US market heatmap (Source: TradingView)\" class=\"wp-image-507178 size-large\" height=\"435\" src=\"https://cryptoslate.com/wp-content/uploads/2025/11/Screenshot-2025-11-14-at-09.55.40-1024x435.png\" width=\"1024\" /><figcaption class=\"wp-caption-text\" id=\"caption-attachment-507178\">US market heatmap (Source: TradingView)</figcaption></figure>\n<p>Markets have been debating whether the earnings and spending path can match the premium baked into those stocks.</p>\n<p>Shares of Nvidia, Alphabet, and Tesla have come <a href=\"https://cryptoslate.com/openai-builds-300b-bubble-machine-the-feedback-loop-rewiring-wall-street-finance/\">under pressure</a> as traders reassess how much AI-driven revenue and margin expansion can realistically land within the next few years.</p>\n<p>When these names lose altitude, cap-weighted indices move with them, and passive products like SPY show broad declines even if other sectors are relatively stable.</p>\n<h2>Reshaping risk premiums and driving a broad rethink of where capital can safely sit.</h2>\n<p>The move is not only about valuations, it is also about positioning and flows. There has been a rotation out of the prior “everything up” phase toward a more defensive stance as policy, macro, and earnings uncertainty builds.</p>\n<p>That is visible in the distribution of sector returns. In the most recent session, technology stocks fell by around 2%, while healthcare stocks gained close to 0.9%.</p>\n<p>Capital is shifting from high-growth areas with multiple returns to value and defensive sectors, such as healthcare and, in some cases, energy.</p>\n<p>From an index-level view, however, the heavy weight of tech means those smaller pockets of green are not enough to offset the drag from mega caps, so the screen still looks uniformly red.</p>\n<p>Macro and political headlines are adding to that caution. The Dow fell approximately 397 points in a single session as traders sought to reduce risk and raise cash.</p>\n<p>Concerns around fiscal negotiations and the prospect of government shutdown brinkmanship in the United States have added another source of uncertainty to the outlook for growth and policy.</p>\n<p>In Europe, the upcoming UK budget forecasts are causing markets to react to the prospect of higher taxes and tighter fiscal room, which is pressuring domestic stocks and weighing on broader European sentiment.</p>\n<p>Together, these factors create an environment where cross-border flows into US equities can slow or reverse, which further amplifies weakness in benchmarks such as the S&amp;P 500.</p>\n<p>This backdrop matters for crypto because the same drivers shape funding, leverage, and risk appetite on-chain and in derivatives.</p>\n<h2>How shifting rate expectations and tech unwinds triggered the sell-off.</h2>\n<p>For much of the year, Bitcoin and large-cap digital assets have behaved as <a href=\"https://cryptoslate.com/market-reports/this-high-beta-bitcoin-proxy-sector-is-lagging-behind-btc-price-2025/\">high-beta</a> expressions of the same macro trade that supported growth equities.</p>\n<p>When real yields rise, the dollar strengthens, and volatility increases in stocks, multi-asset funds, and crossover traders often reduce their exposure across the board.</p>\n<p>That means de-risking in tech portfolios can coincide with reductions in crypto holdings, forced liquidations in perpetual futures, and lower demand for leverage.</p>\n<p>Even crypto-native flows feel the impact as stablecoin yields compete with Treasury rates and marginal capital faces a clearer opportunity cost.</p>\n<p>At the same time, the structure of equity indices shapes how “everything red” appears on trading dashboards. SPY tracks large-cap US stocks, with considerable weight in information technology and communication services.</p>\n<p>When those sectors come under pressure, the ETF reflects that move almost immediately.</p>\n<p>According to the <a href=\"https://www.ft.com/content/36211977-d032-401d-a15c-9404d547c3b1\">Financial Times</a>, a renewed bout of “tech jitters” has driven broad US stock declines, as traders question whether the AI and cloud spend cycle can keep pace with prior expectations.</p>\n<p>SPY’s drop of roughly 1.8% fits that pattern, where heavy selling in a concentrated group of leaders pulls the rest of the basket lower even if some defensive or value names are flat or slightly positive.</p>\n<p>Flows also matter around the edges. When buyback programs pause during blackout windows, a steady source of corporate demand for shares temporarily disappears.</p>\n<p>If that coincides with higher volatility, hawkish central bank messaging, and headline risk around budgets or shutdowns, selling pressure has fewer natural counterparties.</p>\n<p>Earnings results have been solid in many cases; yet, the bar set by prior guidance and market expectations leaves less room for an upside surprise.</p>\n<h2><strong>Parsing what comes next: why cross-asset signals matter now.</strong></h2>\n<p>In that environment, “good enough” numbers can still lead to downward price moves as traders lock in gains and fade stretched narratives.</p>\n<p>For crypto markets, the forward path hinges on how this macro repricing evolves rather than on any single equity session.</p>\n<p>If the higher-for-longer policy remains the base case and the cost of capital stays elevated, the hurdle rate for speculative and long-duration assets remains high.</p>\n<p><a href=\"https://cryptoslate.com/coins/bitcoin\">Bitcoin’s</a> role as a liquidity asset, macro hedge, or risk asset can shift across cycles, so monitoring realized correlation with equities, ETF flow data, and stablecoin market value will be important for reading whether the current sell-off reflects a temporary flush or a deeper reset of risk appetite.</p>\n<p>For now, a slower path to rate cuts, pressure on crowded tech and AI trades, and more cautious global capital flows are working together to keep both equities and crypto in the same red zone.</p>\n<p>The post <a href=\"https://cryptoslate.com/why-is-everything-down-macro-shock-turns-bitcoin-and-other-risk-assets-red-across-the-board/\">Why is everything down? Macro shock turns Bitcoin and other risk assets red across the board</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>",
    "author": "Liam 'Akiba' Wright",
    "published_at": "2025-11-14T10:30:54",
    "categories": [
      "Analysis",
      "Featured",
      "In Focus",
      "Macro",
      "Market"
    ]
  }
]